Documents/абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов/абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов</name>
  <registerRecords>InformationRegister.абс_ЗначенияСвойствНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/абс_ЗначенияСвойствНоменклатурыКонтрагентов/абс_ЗначенияСвойствНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЗначенияСвойствНоменклатурыКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеСвойства</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/абс_УстановкаЗначенийСвойствНоменклатурыКонтрагентов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого СтрокаТаб Из Товары Цикл
		Движение = Движения.абс_ЗначенияСвойствНоменклатурыКонтрагентов.Добавить();
		Движение.Период           = Дата;
		Движение.Контрагент       = Контрагент;
		Движение.Номенклатура     = СтрокаТаб.Номенклатура;
		Движение.Свойство         = СтрокаТаб.Свойство;
		Движение.ЗначениеСвойства = СтрокаТаб.ЗначениеСвойства;
	КонецЦикла;
	
	Движения.абс_ЗначенияСвойствНоменклатурыКонтрагентов.Записывать = Истина;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Свойство) Тогда
		Для Каждого СтрокаТаб Из Товары Цикл
			СтрокаТаб.Свойство = Свойство;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
